<a href="https://colab.research.google.com/github/dasigiraghu96/Ineuron-Assignments/blob/master/Assignment_Pandas_Data_Cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

**1.Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).**

In [263]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [264]:
for i in range(len(df['FlightNumber'])):
  df.loc[i,'FlightNumber']=int(10045+10*i)
df['FlightNumber']=df['FlightNumber'].astype(int)
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

**2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [265]:
#method 1
temp=df['From_To'].str.split('_',n=1,expand=True)
temp.columns=['From','To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [266]:
#method 2
From=list(df['From_To'].apply(lambda x:str(x).split('_')[0]))
To=list(df['From_To'].apply(lambda x:str(x).split('_')[1]))
temp2=pd.DataFrame({'From':From,'To':To})
temp2

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase**

In [0]:
temp2=temp2.applymap(lambda x:x.title())

**4.Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.**

In [0]:
del df['From_To']
df=pd.concat([df,temp2],axis=1)

**5.In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.**

In [269]:
N=df['RecentDelays'].apply(len).max()
df['RecentDelays'].apply(lambda x:x.extend([np.nan]*(N-len(x))))

0    None
1    None
2    None
3    None
4    None
Name: RecentDelays, dtype: object

In [270]:
delay=pd.DataFrame(np.array(df['RecentDelays'].tolist()))
delay.columns=['delay_'+str(i+1) for i in range(N)]
delay

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [272]:
df=pd.concat([df['FlightNumber'],delay,df[['Airline','From','To']]],axis=1)
df

   FlightNumber  delay_1  delay_2  ...              Airline      From         To
0         10045     23.0     47.0  ...               KLM(!)    London      Paris
1         10055      NaN      NaN  ...    <Air France> (12)    Madrid      Milan
2         10065     24.0     43.0  ...  (British Airways. )    London  Stockholm
3         10075     13.0      NaN  ...       12. Air France  Budapest      Paris
4         10085     67.0     32.0  ...          "Swiss Air"  Brussels     London

[5 rows x 7 columns]